Series Practice:

Create a Series of 10 numbers (1–10).

Slice the Series to get only even numbers.

Find the sum and mean of the Series.

In [4]:
import pandas as pd

In [12]:
df = pd.Series([1,2,3,4,5,6,7,8,9,10])
even_number = df[df % 2 == 0]
print(even_number)

print("sum:",df.sum())
print("Mean:", df.mean())

1     2
3     4
5     6
7     8
9    10
dtype: int64
sum: 55
Mean: 5.5

DataFrame Practice:

Create a DataFrame from a dictionary with columns Name, Age, City.

Change column names to lowercase.

Reset the index after dropping the first row.

Select all rows where Age > 25.

Add a new column Salary with random integers 30k–60k.

In [23]:
data = {
    'Name':['John', 'Bob', 'sam'],
    'Age':[23,33,24],
    'City':['USA','ENG', 'IND']
}

df = pd.DataFrame(data)

df.columns = df.columns.str.lower()

df_dropped = df.drop(0).reset_index(drop=True)

age_gt_25 = df[df['age'] > 25]

df

   name  age city
0  John   23  USA
1   Bob   33  ENG
2   sam   24  IND